In [11]:
import pandas as pd

In [12]:
student_gpa = pd.read_csv('student_gpa.csv', sep=';')

In [13]:
student_gpa.head()

           student  age  GPA             field
0      James Smith   22  3.8  Computer Science
1     Mary Johnson   20  3.5        Psychology
2  Robert Williams   24  3.2           Biology
3   Patricia Brown   21  3.9       Engineering
4       John Jones   23  3.6       Mathematics

In [14]:
erasmus = pd.read_csv('erasmus.csv', sep = ',')

In [15]:
erasmus

             student  age home country exchange country
0        James Smith   22          USA           France
1       Mary Johnson   20           UK          Germany
2    Robert Williams   24       Canada            Spain
3     Patricia Brown   21    Australia            Italy
4         John Jones   23      Ireland      Netherlands
..               ...  ...          ...              ...
117     Mason Walker   21        Chile         Portugal
118     Sophia Young   24         Peru           Poland
119       Logan Hall   26     Colombia   Czech Republic
120        Ava Allen   22    Venezuela          Hungary
121     Lucas Wright   25      Ecuador           Greece

[122 rows x 4 columns]

In [16]:
gpa_erasmus = pd.merge(student_gpa, erasmus, on = ['student', 'age'])

In [18]:
gpa_erasmus.head()

           student  age  GPA             field home country exchange country
0      James Smith   22  3.8  Computer Science          USA           France
1     Mary Johnson   20  3.5        Psychology           UK          Germany
2  Robert Williams   24  3.2           Biology       Canada            Spain
3   Patricia Brown   21  3.9       Engineering    Australia            Italy
4       John Jones   23  3.6       Mathematics      Ireland      Netherlands

In [24]:
interval = gpa_erasmus['age'].quantile(0.75) - gpa_erasmus['age'].quantile(0.25)
interval

np.float64(3.0)

In [22]:
print('Lower Quartile of GPA: ', gpa_erasmus['GPA'].quantile(0.25))
print('Upper Quartile of GPA: ', gpa_erasmus['GPA'].quantile(0.75))
print('Interquartile Range of total ', gpa_erasmus['GPA'].quantile(0.75) - gpa_erasmus['GPA'].quantile(0.25))

Lower Quartile of GPA:  3.5
Upper Quartile of GPA:  3.8
Interquartile Range of total  0.2999999999999998

In [23]:
stats = gpa_erasmus['GPA'].describe()
print(stats)

count    115.000000
mean       3.623478
std        0.220975
min        3.000000
25%        3.500000
50%        3.600000
75%        3.800000
max        4.000000
Name: GPA, dtype: float64